Merge pull request #14 from mica1505/move-priority-after-retrieve
Rework agent nodes
